[
  {
    "date": "2025-01-01",
    "members": {
      "نادر": {
        "rating": 2,
        "description": "أداء جيد في المهمة الصباحية ولكن تأخر في تسليم الجزء المسائي"
      },
      "وليد": {
        "rating": 3,
        "description": "متفوق في التعامل مع العملاء الجدد وأتم المهام المطلوبة في الوقت"
      },
      "أحمد": {
        "rating": 1,
        "description": "تغيب عن الاجتماع الصباحي ولم يكمل المهام الموكلة إليه"
      },
      "محمد": {
        "rating": 3,
        "description": "ساهم بأفكار مبتكرة لحل مشكلة الفريق وتحمل مسؤوليات إضافية"
      },
      "لمياء": {
        "rating": 2,
        "description": "نفذت المهام المطلوبة ولكن مع بعض الأخطاء البسيطة تحتاج للتحسين"
      }
    }
  },
  {
    "date": "2025-01-02",
    "members": {
      "نادر": {
        "rating": 4,
        "description": "تحسن ملحوظ في الأداء اليوم، أتم جميع المهام قبل الموعد"
      },
      "وليد": {
        "rating": 3,
        "description": "أداء ثابت ومستقر، تعامل باحترافية مع التحديات الجديدة"
      },
      "أحمد": {
        "rating": 2,
        "description": "حضر الاجتماعات ولكن يحتاج لمزيد من التركيز في التنفيذ"
      },
      "محمد": {
        "rating": 5,
        "description": "أداء استثنائي، قاد الفريق لحل مشكلة معقدة وقدم تدريبًا للزملاء"
      },
      "لمياء": {
        "rating": 4,
        "description": "إنجاز ممتاز في المشروع الجديد مع اهتمام بالتفاصيل الدقيقة"
      }
    }
  },
  {
    "date": "2025-01-03",
    "members": {
      "نادر": {
        "rating": 5,
        "description": "تفوق في تنظيم مشروع الفريق وقدم حلولاً مبتكرة وزاد الإنتاجية"
      },
      "وليد": {
        "rating": 4,
        "description": "تعاون ممتاز مع الفريق وساعد في تدريب الأعضاء الجدد"
      },
      "أحمد": {
        "rating": 3,
        "description": "تحسن كبير، التزم بالمواعيد وشارك بفاعلية في المناقشات"
      },
      "محمد": {
        "rating": 4,
        "description": "قاد بنجاح اجتماع العميل وحصل على رضا كامل عن الخدمة"
      },
      "لمياء": {
        "rating": 5,
        "description": "إبداع في التصميم وتفانٍ في العمل الإضافي لإنجاز المشروع"
      }
    }
  },
  {
    "date": "2025-01-04",
    "members": {
      "نادر": {
        "rating": 3,
        "description": "أداء معتاد مع بعض التحديات التقنية التي تأثر بها الأداء"
      },
      "وليد": {
        "rating": 4,
        "description": "مبادر في حل المشكلات وقدم اقتراحات قيمة لتحسين العمل"
      },
      "أحمد": {
        "rating": 2,
        "description": "احترام المواعيد ولكن يحتاج لمزيد من الجودة في التسليم"
      },
      "محمد": {
        "rating": 3,
        "description": "سليم مع وجود مجال للتحسين في التواصل مع الفريق"
      },
      "لمياء": {
        "rating": 4,
        "description": "إدارة ممتازة للوقت وتقديم عمل بجودة عالية ضمن الجدول"
      }
    }
  }
]